etc/OpenFOAM_Sample_Files/indoor_airflow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volVectorField;
	location	"0";
	object		U;
}

dimensions		[0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		fixedValue;

        value		uniform (2.0 0.0 0.0);

    }

    room
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

    east_window
    {

        type		zeroGradient;

    }

}