etc/OpenFOAM_Sample_Files/indoor_airflow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    west_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1442;
        startFace       111653;
    }
    room
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14318;
        startFace       113095;
    }
    east_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1966;
        startFace       127413;
    }
)

// ************************************************************************* //
