etc/OpenFOAM_Sample_Files/indoor_airflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
(10.0 10.0 0.0)
(0.0 10.0 0.0)
(10.0 0.0 7.0)
(10.0 10.0 7.0)
(10.0 0.0 0.0)
(0.0 10.0 7.0)
(0.0 0.0 0.0)
(0.0 0.0 7.0)
);

blocks
(
   hex (6 4 0 1 7 2 3 5) (3 4 4) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (
            (6 4 2 7)
            (4 0 3 2)
            (0 1 5 3)
            (1 6 7 5)
            (4 6 1 0)
            (7 2 3 5)
       );
   }
);

mergePatchPair
(
);
