etc/OpenFOAM_Sample_Files/indoor_airflow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
}

solvers
{

    p
    {

        agglomerator		faceAreaPair;

        relTol		0.1;

        tolerance		1e-7;

        nCellsInCoarsestLevel		10;

        smoother		GaussSeidel;

        solver		GAMG;

        cacheAgglomeration		on;

        nPostSweeps		2;

        nPreSweepsre		0;

        mergeLevels		1;

    }

    U
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    k
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    epsilon
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

}

SIMPLE
{

    nNonOrthogonalCorrectors		2;

    residualControl
    {

        k		1e-5;

        U		1e-5;

        epsilon		1e-5;

        p		1e-5;

    }

}

relaxationFactors
{

    p		0.3;

    U		0.7;

    k		0.7;

    epsilon		0.7;

}