etc/OpenFOAM_Sample_Files/indoor_airflow/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/

functions
{

    probes
    {

        functionObjectLibs		("libsampling.so");

        type		probes;

        name		probes;

        fields		(U p);

...

        writeControl		timeStep;

        writeInterval		1;

    }

}